#### Terraform Format and Style 🖌``
#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Terraform Validation ``
<details><summary>Show Plan</summary>
```

terraform
module.vpc2.google_compute_network.vpc_network: Refreshing state... [id=projects/custom-valve-332208/global/networks/terraform-networkss]
module.vpc2.google_compute_subnetwork.public-subnetwork: Refreshing state... [id=projects/custom-valve-332208/regions/europe-west1/subnetworks/terraform-subnetworks]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sa.google_project_service.project will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "var.gcp_project_id"
      + service                    = "iam.googleapis.com"
    }

  # module.sa.google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "service-account-id"
      + display_name = "Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @rrajpald, Action: `pull_request`*